 IDENTIFICATION DIVISION.                                      
 PROGRAM-ID. STR.                                            
 DATA DIVISION.                                                
  WORKING-STORAGE SECTION.                                     
  77 NAME PIC X(20) VALUE 'DIVYANSHU SINGH'.                   
  77 NAME1 PIC X(20) VALUE 'D.SINGH'.                          
  77 FNAME PIC X(10).                                          
  77 LNAME PIC X(10).                                          
  01 WS-TABLE.                                                 
    05 WS-A PIC X(20) OCCURS 15 TIMES.                         
 PROCEDURE DIVISION.                                           
          
      STRING
            NAME DELIMITED BY Space
            NAME1 DELIMITED BY SIZE
            FNAME DELIMITED BY SIZE
                      INTO LNAME

              DISPLAY LNAME
                                      
      MOVE FNAME TO WS-TABLE.                                  
      DISPLAY WS-A(1) "." WS-A(10)".".                         
      STOP RUN.                                                